Feature: Number

	Scenario Outline: Standardize numbers
		Given the original chinese number is "<chi_d>"
		When we standardize it
		Then the number in standard form is "<eng_d>"
	
		Examples:
		 | chi_d                           | eng_d              |
		 | 二十二                             | 2十2                |

	Scenario Outline: Standardize and Precompute numbers
		Given the original chinese number is "<chi_d>"
		When we precompute it
		Then the number in precomputed form is "<eng_d>"
 
		Examples:
		 | chi_d                           | eng_d              |
		 | 二十二                             | 22.0               |
		 | 兩千零百二十二                         | 2022.0             |
		 | 二十二萬                            | 220000.0           |
		 | 二十二萬兩千零百二十二                     | 222022.0           |
		 | 二百〇五                            | 205.0              |
		 | 十萬〇四                            | 100004.0           |
		 | 一千一百一十一兆一千一百一十一億一千一百一十一萬一千一百一十一 | 1111111111111111.0 |
		 | 一百一十一兆一千一百一十一億一千一百一十一萬一千一百一十一   | 111111111111111.0  |
		 | 一十一兆一千一百一十一億一千一百一十一萬一千一百一十一     | 11111111111111.0   |
		 | 十一兆一千一百一十一億一千一百一十一萬一千一百一十一      | 11111111111111.0   |
		 | 一兆一千一百一十一億一千一百一十一萬一千一百一十一       | 1111111111111.0    |
		 | 一千一百一十一億一千一百一十一萬一千一百一十一         | 111111111111.0     |
		 | 一百一十一億一千一百一十一萬一千一百一十一           | 11111111111.0      |
		 | 一十一億一千一百一十一萬一千一百一十一             | 1111111111.0       |
		 | 十一億一千一百一十一萬一千一百一十一              | 1111111111.0       |
		 | 一億一千一百一十一萬一千一百一十一               | 111111111.0        |
		 | 一千一百一十一萬一千一百一十一                 | 11111111.0         |
		 | 一百一十一萬一千一百一十一                   | 1111111.0          |
		 | 一十一萬一千一百一十一                     | 111111.0           |
		 | 十一萬一千一百一十一                      | 111111.0           |
		 | 一萬一千一百一十一                       | 11111.0            |
		 | 一千一百一十一                         | 1111.0             |
		 | 一百一十一                           | 111.0              |
		 | 一十一                             | 11.0               |
		 | 十一                              | 11.0               |
		 | 一                               | 1.0                |
		 | 一千零百零十一                         | 1001.0             |
		 | 1,111萬1,111                     | 11111111.0         |
		 | 1,111 萬1,111                    | 11111111.0         |
		 | 1.1萬1,111                       | 12111.0            |
		 | 5.8萬590                         | 58590.0            |
		 | 一千9百0十0萬6千一百3十一                 | 19006131.0         |
		 | 1.06億                           | 106000000.0        |
		 | 570.45億                         | 57045000000.0      |
		 | 1,570.45 億                      | 157045000000.0     |
		 | 3,751億                          | 375100000000.0     |
		 | 123456                          | 123456.0           |
		 | 0982780780                      | 982780780.0        |
		 | 09.8278078                      | 9.8278078          |
		 | 1億6                             | 160000000.0        |
		 | 五千八														 | 5800.0							|
		 | 萬億															 | 1000000000000.0		|
		 |一萬零兩百														 | 10200.0						|
		 |七十四点二五亿													 | 7425000000.0  			|
		 |一万零四十三点一四一五九二六									 | 10043.1415926			|
		 |二百四十零萬一四												 | 2401400.0					|
		 |两亿零八十万													 | 200800000.0				|
		 |九千零三十四億一百零二萬八百七十六								 | 903401020876.0			|
		 |十二兆三千四百五十六億七千八百九十萬兩千三百四十五				 | 12345678902345.0		|
		 |一千〇五萬二十六												 | 10050026.0					|
		 |一萬兩千三百四十五點六七八九									 | 12345.6789					|
		
	Scenario Outline: Standardize, Precompute and Translate numbers
		Given the original chinese number is "<chi_d>"
		When we translate it
		Then it should show as "<eng_d>"
	
		Examples:
		    | chi_d               | eng_d              |
		    | 一千9百0十0萬6千一百3十一     | 19,006,131         |
		    | 一111111111          | 1,111,111,111      |
		    | 一.54365             | 1.54365            |
		    | 一952                | 1,952              |
		    | 一952.237465         | 1,952.237465       |
		    | 一95267.237465       | 195,267.237465     |
		    | 1億6                 | 160 million        |
		    | 一0,444,000          | 10,444,000         |
		    | 一0,400,000          | 10.4 million       |
		    | 一0,440,000          | 10.44 million      |
		    | 一0,400,000,006      | 10,400,000,006     |
		    | 一,999,000,000       | 1,999,000,000      |
		    | 一,900,000,000       | 1.9 billion        |
		    | 一0,400,000,000      | 10.4 billion       |
		    | 一00,400,000,000     | 100.4 billion      |
		    | 一,999,000,000,000   | 1.999 trillion     |
		    | 一,999,900,000,000   | 1,999,900,000,000  |
		    | 一99,999,000,000,000 | 199.999 trillion   |
		    | 999,一99,000,000,000 | 999.199 trillion   |
		    | 一,000,008,000,000   | 1,000,008,000,000  |
		    | 一,000,400,000,000   | 1,000,400,000,000  |
		    | 一4,000,001,000,000  | 14,000,001,000,000 |
		    | 一,900,000,000,000   | 1.9 trillion       |
		    | 一,990,000,000,000   | 1.99 trillion      |
		    | 一,999,000,000,000   | 1.999 trillion     |
		    | 一4,000,000,000,000  | 14 trillion        |
		    | -一4,000,000,000,000 | -14 trillion       |
			  | 五千八百								| 5,800		           |
			  | 兩百五十								|	250                |
			  | 三百萬									|	3 million          |
			  | 三百万									|	3 million          |
			  | 7十									|	70                 |
			  | 九億									|	900 million        |
			  | 二十万零三点一八						|	200,003.18         |
			  | 6.25亿								|	625 million        |
			  | 1500万								|	15 million         |
			  | 五億三千九百二十萬四千四百四十一		|	539,204,441        |
			  | 壹仟叄佰柒拾捌							|	1,378							 |
			  | 四百零一                | 401                |
			  | 四千零一	 							| 4,001              |
			  | 四万零一	 							| 40,001             |
			  | 四十万零一	 							| 400,001            |
			  | 四百万零一	 							| 4,000,001          |
			  | 四千万零一	 							| 40,000,001         |
			  | 四億零五	 							| 400,000,005        |
			  | 四億零五十五	 						| 400,000,055        |
			  | 一百零五万零五百零一					| 1,050,501          |
				|一百零五万零五百一						| 1,050,510 				 |
				|四億五 									| 450 million				 |
				
		Examples:
	    | chi_d               | eng_d              |
			| casa  							| n.a.  						 |
	  	| #@$.  							| n.a.  						 |
	  	| 一個    							| n.a.  						 |
		  | 24casas							| n.a.  						 |
		  | hola24caca  				| n.a.  						 |
	